local M = {}

M.data = {
	[5] = "客厅钥匙",
	[7] = "西图书馆钥匙",
	[8] = "礼堂钥匙",
	[10] = "前门钥匙",
	[11] = "地下室门钥匙",
	[12] = "主楼梯平台钥匙",
	[13] = "活板门钥匙",

	[17] = "一个空的陶罐。看起来有什么东西被从里面扯了出来",
	[18] = "一个带有酒红色天鹅绒顶面的脚凳",

	[23] = "一个木箱。它被钉死了",
	[24] = "一个大木箱被存放在这里",
	[25] = "一个大木箱被存放在这里",
	[26] = "一个装满酒精饮料的重橡木桶",
	[28] = "一个沉重的橡木箱子。它锁得很紧",

	[31] = "一个桦木床头柜。里面有各种个人物品",
	[32] = "一个抽屉柜。里面没什么有用的东西",
	[33] = "一个抽屉柜。没什么有用的",
	[34] = "一个装满废弃杂物的抽屉柜。没什么有帮助的",
	[35] = "一个结实的橡木沙发，配有深红色软垫",
	[36] = "一个结实的橡木沙发，配有深红色软垫",

	[37] = "一个小搪瓷壶。它很脏",
	[38] = "一个大蓝色搪瓷花瓶。里面有蜘蛛",
	[39] = "..",

	[40] = "一个带轮子的大洗衣篮。里面没什么有趣的东西",
	[41] = "一台商用级洗衣机。\n它是空的",

	[43] = "一盆植物在这里生长",
	[44] = "一个落地钟。\n它停了",
	[45] = "一张看起来很沉重的木制办公桌，配有绿色皮革台面",
	[46] = "一张看起来很沉重的木制办公桌，配有绿色皮革台面",
	[47] = "一张普通的木桌",
	[48] = "一张普通的木桌",

	[51] = "一个带有蓝色毛毡表面的古董橡木橱柜",
	[52] = "一个带有蓝色毛毡表面的古董橡木橱柜",
	[61] = "一些沉重的铁门。无法通过",
	[64] = "一个结实的橡木沙发，配有深红色软垫",

	[76] = "一个大书柜，里面有许多布满灰尘的旧书",
	[84] = "一张普通的木桌",
	[98] = "一张普通的木桌",

	[124] = "一具尸体。\n即使在死亡中，他看起来也很惊恐",
	[135] = "一个小书柜",
	[136] = "一块老旧褪色的墓碑",
	[137] = "一个高大的蓝色灯架",

	[144] = "..",
	[145] = "..",
	[146] = "..",
	[147] = "..",
	
	[155] = "..",
	[156] = "..",
	[157] = "..",
	[158] = "..",

	[159] = "一个打开的绿色保险箱",
	[160] = "一个打开的蓝色保险箱",
	[161] = "一个打开的黄色保险箱",
	[162] = "萨莎的盒子",

	[163] = "绿色宝石",
	[164] = "蓝色宝石",
	[165] = "黄色宝石",
	[166] = "橙色宝石",

	[169] = "一些纸张散落在这里",
	[170] = "这里有一张潦草的纸条。\n我看不懂",
	[171] = "一些深深的划痕，看起来像是血迹",
	[172] = "某种粘稠的残留物",

	[173] = "绿色保险箱密码：\n4792",
	[174] = "蓝色保险箱密码：\n5396",
	[175] = "黄色保险箱密码：\n7082",
	[176] = "橙色保险箱密码：\n1403",
}

M.journal = {
	[1] = "星期三 7日\n\n长久以来一直流传着关于这个地方幽灵的传说。\n\n我告诉自己，这当然是给孩子们讲的有趣故事，仅此而已。\n\n每座老房子都会随着岁月发出吱吱嘎嘎的声音。\n\n夜晚突然的声响，灰尘和污垢出现在每一个表面。这只是座老房子罢了。\n\n我似乎被困在这里，找不到出路。如果我看到任何幽灵，或者任何东西，我就直接逃跑。",
	[2] = "星期四 8日\n\n这里肯定有什么东西和我在一起。我用眼角余光看到了它。\n\n一个邪恶的东西盯着我。\n\n很长一段时间我躲在角落里，它似乎没有发现我。那会是什么？\n\n我真的看到了什么吗？我很确定我看见了。\n\n我需要到前门那里，找到离开这里的路。\n\n不过我不太喜欢外面那个阴森的墓地。",
	[3] = "星期五 9日\n\n这是我被困在这里的第三天。多么糟糕的地方，我找不到任何出路。\n\n设法打开了前门，但外面只有高墙和大门。\n\n现在我躲在楼上的某个卧室里。这里有很多地方可以藏身。\n\n天亮时我会再次冒险出去，寻找隐藏的通道，或者别的什么。这些老房子充满了秘密。",
	[4] = "星期六 10日\n\n我又检查了前庭院。在其中一块墓地里发现了一块奇怪的石板。\n\n上面有四个圆形凹槽，看起来它能做什么，但我不确定是什么。\n\n我也不喜欢外面，但总比里面好。我感觉没有被那么多地监视，虽然我可能确实被监视着。\n\n我要去调查图书馆，看看那里有什么能帮上忙的。"
}

function M.getitemtext(item)
	return M.data[item]
end

M.INV_SIZE = 5
M.inv = {0,0,0,0,0,0}

function M.get(slot)
	return M.inv[slot]
end

function M.clearall()
	M.inv = {0,0,0,0,0,0}
end

function M.check(item)
	local slot = 0

	for n = 1, M.INV_SIZE do
		if M.inv[n] == item then
			slot = n
		end
	end

	return slot
end

function M.use(slot)
	M.inv [slot] = 0
	for n = slot, M.INV_SIZE - 1 do
		M.inv[n] = M.inv[n+1]
	end

	M.inv[M.INV_SIZE] = 0
end

function M.store(item)
	local n = 1

	while M.inv[n] ~= 0 do
		n = n + 1
	end

	if n <= M.INV_SIZE then 
		M.inv[n] = item
	else
		return false
	end

	return true
end

function M.getjournaltext(num)
	return M.journal[num]
end

return M