local M = {}

M.name = {
	[-200] = "西图书馆下层",
	[-195] = "墓地下层", 
	[-196] = "主大门",
	[-197] = "地下室东侧",
	[-198] = "地下室",
	[-199] = "地下室西侧",
	[-100] = "西图书馆上层",
	[-99] = "侧书房",
	[-98] = "地下室楼梯",
	[-97] = "有毒的墓地",
	[-96] = "宏伟入口大道",
	[-95] = "墓地上层", 
	
	[0] = "客厅",
	[1] = "书房",
	[2] = "储藏区",
	[3] = "西入口大厅",
	[4] = "入口大厅",
	[5] = "东入口大厅",
	[6] = "隐藏通道",
	[7] = "隐藏庭院",

	[100] = "西走廊A",
	[101] = "绿色房间",
	[102] = "西走廊B",
	[103] = "洗衣区B",
	[104] = "主楼梯",
	[105] = "东图书馆",
	[106] = "竖井",
	
	[200] = "西走廊A",
	[201] = "后台区域",
	[202] = "洗衣区A",
	[203] = "西主楼梯平台",
	[204] = "主楼梯平台",
	[205] = "东主楼梯平台",
	[206] = "旧储藏室",

	[300] = "道具室",
	[301] = "主舞台",
	[302] = "中央走廊",
	[303] = "春季卧室",
	[304] = "卧室走廊",
	[305] = "秋季卧室",

	[400] = "西休息室",
	[401] = "礼堂",
	[402] = "东休息室",
	[403] = "西侧房间",
	[404] = "主套房",
	[405] = "东侧房间",
}

function M.getname(id)
	return M.name[id]
end

return M